# Data Exploration
- first step in DS / ML pipeline
- we can undersrand structure, size, types of data
- check missing, incorrect
- find distribution and patterns

In [ ]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 29],
    'City': ['Pune', 'Delhi', 'Mumbai', 'Delhi', 'Pune'],
    'Score': [85, 90, 95, 80, 88]
}

df = pd.DataFrame(data)
df

      Name  Age    City  Score
0    Alice   25    Pune     85
1      Bob   30   Delhi     90
2  Charlie   35  Mumbai     95
3    David   40   Delhi     80
4      Eva   29    Pune     88

In [ ]:
df.City.value_counts()   # shows frequency

df.City.value_counts(normalize=True)  # get percetage of freq

City
Pune      0.4
Delhi     0.4
Mumbai    0.2
Name: proportion, dtype: float64

## Selecting Columns

In [8]:
df['Name']   # gives a Series which also have index
df[['Name']]  # Dataframe

df[['Name', 'City']]

      Name    City
0    Alice    Pune
1      Bob   Delhi
2  Charlie  Mumbai
3    David   Delhi
4      Eva    Pune

## Selecting Rows

In [ ]:
# Using loc

df.loc[0]
df.loc[0:2] # including 0 and 2

      Name  Age    City  Score
0    Alice   25    Pune     85
1      Bob   30   Delhi     90
2  Charlie   35  Mumbai     95

In [ ]:
# using iloc

df.iloc[0]
df.iloc[0:3] # not including last

      Name  Age    City  Score
0    Alice   25    Pune     85
1      Bob   30   Delhi     90
2  Charlie   35  Mumbai     95

## Selecting Column and Rows

In [15]:
df.loc[0:2, ['Name', 'Score']]

df.iloc[0:3, 0:2]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35